espressif/esp-idf/examples/bluetooth/esp_hid_device/sdkconfig.defaults.esp32s3
#
# Automatically generated file. DO NOT EDIT.
# Espressif IoT Development Framework (ESP-IDF) Project Configuration
#
CONFIG_IDF_CMAKE=y
CONFIG_IDF_TARGET_ARCH_RISCV=y
CONFIG_IDF_TARGET="esp32c3"
CONFIG_IDF_TARGET_ESP32C3=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0005

#
# Bluetooth
#
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
